#+TITLE: DM2 Assignment 03.4
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: theme-bigblow.setup

[[elisp:(relocate-file-to-work-folder)][Relocate File to Work Folder]]
[[elisp:(browse-url-of-file%20(org-html-export-to-html))][Export to HTML and Browse]]
[[elisp:(org-clock-report%201)][Insert/Update Clock Summary Report]]
** Sample Code

#+BEGIN_SRC elisp :results silent :tangle 3x+1conjecture.el
  (require 'cl)

  (require 'calc)

  (defmath is-odd (num)
    (= (logand num 1) 1))

  (defmath 3x+1 (num)
    (if (is-odd num)
        (1+ (* 3 num))
      (/ num 2)))

  (defmath transform-3x+1 (num)
    (while (> num 1)
      (setq num (3x+1 num)))
    num)

  (defun test-3x+1-conjecture (max-num)
    (loop for n from 2 to max-num
          unless (= 1 (calcFunc-transform-3x+1 n))
          collect n))

  (defmacro measure-time (&rest body)
    "Measure and return the running time of the code in body."
    (declare (indent defun))
    (let ((start (make-symbol "start")))
      `(let ((,start (float-time)))
         ,@body
         (- (float-time) ,start))))

  (defun test-100000()
    (print (vector (measure-time (setq results (test-3x+1-conjecture 100000))) results)))
#+END_SRC

#+BEGIN_SRC elisp
  (require 'calc-math)
  (calcFunc-is-odd (setq bn (math-read-number "3589723987598273598723958729385792875982735982759871")))
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC elisp :results code
  bn
#+END_SRC

#+RESULTS:
#+BEGIN_SRC elisp
(bigpos 982759871 875982735 729385792 598723958 987598273 3589723)
#+END_SRC
(lambda (num) (if (calcFunc-is-odd num) (math-add (math-mul 3 num) 1) (math-div num 2)))

#+BEGIN_SRC elisp
  (vector (measure-time (setq results (test-3x+1-conjecture 100000))) results)
#+END_SRC

#+RESULTS:
: [20.126811027526855 nil]

